content/man/man1/virt-xml-validate.1.org
#+TITLE: Manpages - virt-xml-validate.1
* NAME
virt-xml-validate - validate libvirt XML files against a schema

* SYNOPSIS
*virt-xml-validate* /XML-FILE/ [/SCHEMA-NAME/]

*virt-xml-validate* /OPTION/

* DESCRIPTION
Validates a libvirt XML for compliance with the published schema. The
first compulsory argument is the path to the XML file to be validated.
The optional second argument is the name of the schema to validate
against. If omitted, the schema name will be inferred from the name of
the root element in the XML document.

Valid schema names currently include

#+begin_quote
- *cpu*

#+end_quote

The schema for the XML format of cpu

#+begin_quote
- *domainsnapshot*

#+end_quote

The schema for the XML format used by domain snapshot configuration

#+begin_quote
- *domaincheckpoint*

#+end_quote

The schema for the XML format used by domain checkpoint configuration

#+begin_quote
- *domainbackup*

#+end_quote

The schema for the XML format used by domain backup configuration

#+begin_quote
- *domaincaps*

#+end_quote

The schema for the XML format of domain capabilities

#+begin_quote
- *domain*

#+end_quote

The schema for the XML format used by guest domains configuration

#+begin_quote
- *networkport*

#+end_quote

The schema for the XML format used by network port configuration

#+begin_quote
- *network*

#+end_quote

The schema for the XML format used by virtual network configuration

#+begin_quote
- *storagepoolcaps*

#+end_quote

The schema for the XML format of storage pool capabilities

#+begin_quote
- *storagepool*

#+end_quote

The schema for the XML format used by storage pool configuration

#+begin_quote
- *storagevol*

#+end_quote

The schema for the XML format used by storage volume descriptions

#+begin_quote
- *nodedev*

#+end_quote

The schema for the XML format used by node device descriptions

#+begin_quote
- *capability*

#+end_quote

The schema for the XML format used to declare driver capabilities

#+begin_quote
- *nwfilter*

#+end_quote

The schema for the XML format used by network traffic filters

#+begin_quote
- *nwfilterbinding*

#+end_quote

The schema for XML format used by network filter bindings.

#+begin_quote
- *secret*

#+end_quote

The schema for the XML format used by secrets descriptions

#+begin_quote
- *interface*

#+end_quote

The schema for the XML format used by physical host interfaces

* OPTIONS
*-h*, *--help*

Display command line help usage then exit.

*-V*, *--version*

Display version information then exit.

* EXIT STATUS
Upon successful validation, an exit status of 0 will be set. Upon
failure a non-zero status will be set.

* AUTHOR
Daniel P. Berrangé

* BUGS
Please report all bugs you discover. This should be done via either:

#+begin_quote
1. the mailing list

<https://libvirt.org/contact.html>

2. [@2] the bug tracker

<https://libvirt.org/bugs.html>

#+end_quote

Alternatively, you may report bugs to your software distributor /
vendor.

* COPYRIGHT
Copyright (C) 2009-2013 by Red Hat, Inc. Copyright (C) 2009 by Daniel P.
Berrangé

* LICENSE
*virt-xml-validate* is distributed under the terms of the GNU GPL v2+.
This is free software; see the source for copying conditions. There is
NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR
PURPOSE

* SEE ALSO
virsh(1), online XML format descriptions
<https://libvirt.org/format.html> , <https://libvirt.org/>
